{"CYYZ": {"snippet": "Toronto Pearson International Airport is an international airport primarily located in Mississauga, Ontario, Canada. It is the main airport serving Toronto, its metropolitan area, and the surrounding region known as the Golden Horseshoe. Pearson is the largest and busiest airport in Canada, handling 46.8 million passengers in 2024. It is named in honour of Lester B. Pearson (1897–1972), the 14th Prime Minister of Canada and 1957 Nobel Peace Prize laureate for his humanitarian work in peacekeeping.", "points_nearby": []}, "DAAG": {"snippet": "Houari Boumediene International Airport, also known as Algiers Airport or Algiers International Airport, is the main international airport serving Algiers, the capital of Algeria. It is located 9.1 NM east southeast of the city.", "points_nearby": []}, "DAUG": {"snippet": "Noumérat – Moufdi Zakaria Airport, also known as Noumerate Airport, is a public airport serving Ghardaïa, the capital of the Ghardaïa Province in Algeria. It is located 8.6 nautical miles southeast of the city. The airport is named for Moufdi Zakaria (1908–1977), the author of Kassaman, the Algerian national anthem.", "points_nearby": []}, "DTTA": {"snippet": "Tunis–Carthage International Airport is the international airport of Tunis, the capital of Tunisia. It serves as the home base for Tunisair, Tunisair Express, Nouvelair Tunisia, and Tunisavia. The airport is named for the historic city of Carthage, located just east of the airport.", "points_nearby": []}, "EDDB": {"snippet": "Berlin Brandenburg Airport is an international airport in Schönefeld, just south of the German capital and state of Berlin, in the state of Brandenburg. It is located 18 kilometres (11 mi) south-east of the city centre and serves as a base for Condor, easyJet, Eurowings, Ryanair and Sundair. It mostly has flights to European metropolitan and leisure destinations as well as a number of intercontinental services.", "points_nearby": []}, "EDDF": {"snippet": "Frankfurt Airport is Germany's busiest international airport by passenger numbers, located in Frankfurt, Germany's fifth-largest city. Its official name according to the German Aeronautical Information Publication is Frankfurt Main Airport. The airport is operated by Fraport and serves as the main hub for Lufthansa, including Lufthansa City Airlines, Lufthansa CityLine, Discover Airlines and Lufthansa Cargo as well as Condor and AeroLogic. It covers an area of 2,300 hectares of land and features two passenger terminals with capacity for approximately 65 million passengers per year; four runways; and extensive logistics and maintenance facilities.", "points_nearby": []}, "EDDH": {"snippet": "Hamburg Airport, is a major international airport in Hamburg, the second-largest city in Germany. Since November 2016 the airport has been named after the former German chancellor Helmut Schmidt. It is located 8.5 km (5.3 mi) north of the city centre in the Fuhlsbüttel quarter and serves as a hub for Eurowings and focus city for Condor. It was formerly named Hamburg-Fuhlsbüttel Airport, a name still frequently used.", "points_nearby": []}, "EDDK": {"snippet": "Cologne Bonn Airport is an international airport in north-western Germany. It serves the country's fourth-largest city Cologne, as well as Bonn, the former capital of West Germany. In 2024, more than 10 million passengers passed through Cologne Bonn Airport (CGN). It is the first time that passenger numbers have exceeded those in 2019 and hence marks a return to pre-pandemic levels. It is the seventh-largest passenger airport in Germany and the third-largest in terms of cargo operations. By traffic units, which combines cargo and passengers, the airport is in fifth position in Germany. As of March 2015, Cologne Bonn Airport had services to 115 passenger destinations in 35 countries. The airport is named after Cologne native Konrad Adenauer, the first post-war Chancellor of West Germany. The facility covers 1,000 hectares and contains three runways.", "points_nearby": []}, "EDDL": {"snippet": "Düsseldorf Airport, known as Düsseldorf International Airport until March 2013, is an international airport serving Düsseldorf, the capital of the German state of North Rhine-Westphalia. It is about 7 kilometres north of downtown Düsseldorf and some 20 kilometres southwest of Essen in the Rhine-Ruhr area, Germany's largest metropolitan area.", "points_nearby": []}, "EDDM": {"snippet": "Munich Airport is an international airport serving Munich and the surrounding region of Upper Bavaria and Lower Bavaria. Located 28.5 km (17.7 mi) northeast of Munich near the town of Freising, it is named after former Bavarian minister-president Franz Josef Strauss. According to the German Aeronautical Information Publication, the airport's official name is Muenchen Airport.", "points_nearby": []}, "EDDV": {"snippet": "Hannover Airport is the international airport of Hanover, capital of the German state of Lower Saxony. The ninth largest airport in Germany, it is situated on 570 hectares in Langenhagen, 11 kilometres (6.8 mi) north of the centre of Hanover. The airport has flights to European metropolitan and leisure destinations, and serves as a base for Eurowings, Corendon Airlines Europe and TUI fly Deutschland.", "points_nearby": []}, "EGCC": {"snippet": "Manchester Airport is an international airport in Ringway, Manchester, England; it lies 7 miles (11 km) south-west of Manchester city centre. In 2025, it was the third-busiest airport in the United Kingdom in terms of passengers, and the 20th-busiest airport in Europe in 2024, with 32.1 million passengers served.", "points_nearby": []}, "EGGW": {"snippet": "London Luton Airport is an international airport in Luton, Bedfordshire, England. It is 1.7 miles (2.7 km) east of the town centre and is the fourth-busiest airport serving London. The airport is owned by London Luton Airport Limited, a company wholly owned by Luton Borough Council, and is operated by London Luton Airport Operations Limited (LLAOL).", "points_nearby": []}, "EGKK": {"snippet": "London Gatwick Airport is one of several international airports serving Greater London and southern England. It is located near Crawley, in West Sussex, England. In 2024, Gatwick was the second-busiest airport by total passenger traffic in the UK, after Heathrow, and was the tenth-busiest in Europe by total passenger traffic. It covers a total area of 674 hectares.", "points_nearby": []}, "EGLC": {"snippet": "London City Airport is an international airport in London, England. It is located in the Royal Docks in the Borough of Newham, about six miles east of the City of London and three miles east of Canary Wharf. These are the two centres of London's financial industry, which is a major user of the airport. The airport was developed by the engineering company Mowlem between 1986 and 1987. The airport is owned and operated by London City Airport Limited.", "points_nearby": []}, "EGLL": {"snippet": "Heathrow Airport, also known as London Heathrow Airport and named London Airport until 1966, is the primary and largest international airport serving London, the capital of England and the United Kingdom. It is the largest of the six international airports in the London airport system.", "points_nearby": []}, "EGMC": {"snippet": "London Southend Airport is an international airport situated on the outskirts of Southend-on-Sea in Essex, England, approximately 36 mi (58 km) from the centre of London. The airport straddles the boundaries between the city of Southend-on-Sea and the Rochford District.", "points_nearby": []}, "EGNX": {"snippet": "East Midlands Airport is an international airport in Castle Donington, Leicestershire, England. The airport is situated between Loughborough, Derby and Nottingham ; Leicester is 20 miles (32 km) to the south and Lincoln 43 miles (69 km) northeast. It serves the majority of the East Midlands region consisting of the counties of Leicestershire, Nottinghamshire, Lincolnshire, Rutland and Derbyshire. The airfield was originally built as a Royal Air Force station known as RAF Castle Donington in 1943, before being redeveloped as a civilian airport in 1965.", "points_nearby": []}, "EGPH": {"snippet": "Edinburgh Airport is an international airport located in the Ingliston area of Edinburgh, Scotland. It is located five nautical miles west of the city centre, just off the M8 and M9 motorways. It is owned and operated by Edinburgh Airport Limited.", "points_nearby": []}, "EGSS": {"snippet": "Stansted Airport is an international airport serving the south-east of England. It is located near Stansted Mountfitchet, in the district of Uttlesford, Essex; it lies 31 miles north-east of Central London.", "points_nearby": []}, "EHAM": {"snippet": "Amsterdam Airport Schiphol, known informally as Schiphol Airport, is the main international airport of the Netherlands, and is one of the major hubs for the SkyTeam airline alliance. It is located 9 kilometres southwest of Amsterdam, in the municipality of Haarlemmermeer in the province of North Holland. It was the world's fifth busiest airport by international passenger traffic in 2024. With almost 72 million passengers in 2019, it is the third-busiest airport in Europe in terms of passenger volume and the busiest in Europe in terms of aircraft movements. With an annual cargo tonnage of 1.74 million, it is the 4th busiest in Europe. AMS covers a total area of 2,787 hectares of land. The airport is built on the single-terminal concept: one large terminal split into three departure halls.", "points_nearby": []}, "EICK": {"snippet": "Cork Airport is the second-largest international airport in the Republic of Ireland, after Dublin and ahead of Shannon. It is 6.5 kilometres south of Cork City centre, in an area known as Farmers Cross. In 2018, Cork Airport handled 2.39 million passengers, growing by over 8% to 2.58 million in 2019. Following a decline during the COVID-19 global pandemic, which saw passenger numbers fall to 530,000 in 2020, numbers had risen to 3,068,000 by 2024 and 3,460,000 by 2025.", "points_nearby": []}, "EIDW": {"snippet": "Dublin Airport is an international airport serving Dublin, Ireland. It is operated by DAA. The airport is located in Collinstown, seven kilometres north of Dublin, and three kilometres south of Swords.\nIn 2025, over 36.4 million passengers passed through the airport, making it the airport's busiest year on record. It is the 12th busiest airport in Europe, and is the busiest of Ireland's airports by total passenger traffic; it also has the largest traffic levels on the island of Ireland, followed by Belfast International Airport.", "points_nearby": []}, "EPWA": {"snippet": "Warsaw Chopin Airport is an international airport in the Włochy district of Warsaw, Poland. It is the busiest airport in Poland and the 28th busiest airport in Europe with 24.1 million passengers in 2025, handling approximately a third of the country's total air passenger traffic. The airport is a central hub for LOT Polish Airlines as well as a base for Enter Air and Wizz Air.", "points_nearby": []}, "ETNJ": {"snippet": "Jever Air Base is a former German Air Force military air base, located 4.3 km west-southwest of Schortens in Lower Saxony, Germany. It was the home of parts of the German Air Force Regiment. Military flying ceased in September 2013.", "points_nearby": []}, "GMMN": {"snippet": "Mohammed V International Airport IATA: CMN, ICAO: GMMN is an international airport serving Casablanca, Morocco. Located in Nouaceur Province, it is operated by Airports of Morocco.", "points_nearby": []}, "HECA": {"snippet": "Cairo International Airport is the principal international airport of Cairo and the largest and busiest airport in Egypt. It serves as the primary hub for EgyptAir and Nile Air as well as several other airlines. The airport is located in Heliopolis, to the northeast of Cairo around fifteen kilometres from the business area of the city and has an area of approximately 37 km2 (14 sq mi). It is the busiest airport in Africa and the 9th busiest airport in the Middle East in terms of total passengers.", "points_nearby": []}, "KATL": {"snippet": "Hartsfield–Jackson Atlanta International Airport is the primary international airport serving Atlanta and its surrounding metropolitan area in the U.S. state of Georgia. Located 10 mi south of the Downtown Atlanta district, it is named after former Atlanta mayors William B. Hartsfield and Maynard Jackson.", "points_nearby": []}, "KDEN": {"snippet": "Denver International Airport, often referred to by locals as DIA, is an international airport in the Western United States, primarily serving metropolitan Denver, Colorado, as well as the greater Front Range Urban Corridor.", "points_nearby": []}, "KDFW": {"snippet": "Dallas Fort Worth International Airport is the primary international airport serving the Dallas–Fort Worth metroplex and the North Texas region, in the U.S. state of Texas.", "points_nearby": []}, "KJFK": {"snippet": "John F. Kennedy International Airport is a major international airport serving New York City and its metropolitan area. JFK Airport is located on the southwestern shore of Long Island, in Queens, New York City, bordering Jamaica Bay. It is the busiest of the seven airports in the New York airport system, the sixth-busiest airport in the United States, and the busiest international commercial airport in North America. The airport, which covers 5,200 acres (2,104 ha), is the largest in the New York metropolitan area. Over 90 airlines operate from JFK Airport, with nonstop or direct flights to destinations on all six permanently inhabited continents.", "points_nearby": []}, "KLAX": {"snippet": "Los Angeles International Airport is the primary international airport serving Los Angeles and its surrounding metropolitan area, in the U.S. state of California. LAX is located in the Westchester neighborhood of the city of Los Angeles, 18 miles southwest of downtown Los Angeles, with the commercial and residential areas of Westchester to the north, the city of El Segundo to the south, and the city of Inglewood to the east. LAX is the closest airport to the Westside and the South Bay.", "points_nearby": []}, "KMIA": {"snippet": "Miami International Airport, also known as MIA and historically as Wilcox Field, is the primary international airport serving Miami and its surrounding metropolitan area, in the U.S. state of Florida. It hosts over 1,000 daily flights to 195 domestic and international destinations, including most countries in Central and South America and the Caribbean. The airport is in an unincorporated area in Miami-Dade County, Florida, 8 miles (13 km) west-northwest of downtown Miami, in metropolitan Miami, adjacent to the cities of Miami and Miami Springs, and the village of Virginia Gardens. Nearby cities include Hialeah, Doral, and the census-designated place of Fontainebleau.", "points_nearby": []}, "KORD": {"snippet": "Chicago O'Hare International Airport is the primary international airport serving Chicago, Illinois, United States, located on the city's Northwest Side, approximately 17 miles (27 km) northwest of downtown. The airport is operated by the Chicago Department of Aviation and covers 7,627 acres. O'Hare has non-stop flights to 249 destinations in North America, South America, the Caribbean, Europe, Africa, Asia, the Middle East and the North Atlantic region as of summer 2024. As of 2024, O'Hare is considered the most connected airport in the United States, and fifth most connected airport in the world. It is also the world's fourth busiest airport and 16th largest airport. It is the airport with the most runways in the world.", "points_nearby": []}, "KSEA": {"snippet": "Seattle–Tacoma International Airport is the primary international airport serving Seattle and its surrounding metropolitan area in the U.S. state of Washington. It is in the city of SeaTac, which was named after the airport's nickname Sea–Tac, approximately 14 miles (23 km) south of downtown Seattle and 18 miles (29 km) north-northeast of downtown Tacoma. The airport is the busiest in the Pacific Northwest region of North America and is owned by the Port of Seattle.", "points_nearby": []}, "KSFO": {"snippet": "San Francisco International Airport is the primary international airport serving the San Francisco Bay Area in the U.S. state of California. Owned and operated by the City and County of San Francisco, the airport has a San Francisco mailing address and ZIP Code, although it is situated in an unincorporated area of neighboring San Mateo County, approximately 12 miles southeast of San Francisco.", "points_nearby": []}, "LEBL": {"snippet": "Josep Tarradellas Barcelona–El Prat Airport, also known as Barcelona-El Prat Airport, is an international airport located 15 km (9.3 mi) southwest of the centre of Barcelona, lying in the municipalities of El Prat de Llobregat, Viladecans, and Sant Boi, in Catalonia, Spain.", "points_nearby": []}, "LEMD": {"snippet": "Adolfo Suárez Madrid–Barajas Airport is the main international airport serving Madrid, the capital of Spain, and its metropolitan area. At 3,050 ha in area, it is the second-largest airport in Europe by physical size behind Paris Charles de Gaulle Airport. In 2019, 61.8 million passengers travelled through Madrid–Barajas, making it the country's busiest airport as well as Europe's fifth-busiest.", "points_nearby": []}, "LEMG": {"snippet": "Málaga–Costa del Sol Airport is the fourth busiest airport in Spain after Madrid–Barajas, Barcelona–El Prat and Palma de Mallorca. It is significant for Spanish tourism as the main international airport serving the Costa del Sol. It is 8 km (5.0 mi) southwest of Málaga and 5 km (3.1 mi) north of Torremolinos. The airport has flight connections to over 40 countries worldwide, and over 14.4 million passengers passed through it in 2015. In 2023, 22.4 million passengers passed through Málaga Airport. The airport operates with three terminals and two runways.", "points_nearby": []}, "LEPA": {"snippet": "Palma de Mallorca Airport — also known as Son Sant Joan Airport – is an international airport located eight kilometres east of Palma, Mallorca, Spain, adjacent to the village of Can Pastilla.", "points_nearby": []}, "LEPL": {"snippet": "Madrid–Torrejón Airport is a commercial airport in central Spain, a joint-use facility between the Spanish Ministry of Defence and the Ministry of Public Works. The civil part is dedicated primarily to executive and private aviation. The military part is the base of several combat, logistics, and electronic warfare units of the Ejército del Aire y del Espacio, the Spanish Air and Space Force, among them the 12 Combat Wing with F-18 fighters and the official planes of the President of the Government and the King of Spain. It is also the base of the European Union's Satellite Centre (EUSC).", "points_nearby": []}, "LFLL": {"snippet": "Lyon–Saint Exupéry Airport — formerly known as Lyon Satolas Airport — is an international airport servicing Lyon, France, and an important transport facility for the entire Auvergne-Rhône-Alpes region. It lies in Colombier-Saugnieu, 11 nautical miles southeast of Lyon's city centre. The airport is 30 minutes from the Lyon-Part-Dieu business district by the Rhônexpress tram.", "points_nearby": []}, "LFMN": {"snippet": "Nice Côte d'Azur Airport is an international airport located 3.2 NM southwest of Nice, in the Alpes-Maritimes department of France. It is the third busiest airport in France and serves as a focus city for Air France and an operating base for easyJet. In 2025, it handled 15,23 millions passengers. The airport is positioned 7 km (4 mi) west of the city centre, and is the principal port of arrival for passengers to the Côte d'Azur.", "points_nearby": []}, "LFPB": {"snippet": "Paris–Le Bourget Airport is an airport located within portions of the communes of Le Bourget, Bonneuil-en-France, Dugny and Gonesse, 6 NM north-northeast of Paris, France.", "points_nearby": []}, "LFPG": {"snippet": "Paris Charles de Gaulle International Airport, also known as Roissy Airport, is the primary international airport serving Paris, the capital of France. The airport opened in 1974 and is located in Roissy-en-France, 23 km (14 mi) northeast of the city centre of Paris. It is named after World War II leader and French President Charles de Gaulle, whose initials form its IATA airport code.", "points_nearby": []}, "LFPO": {"snippet": "Paris Orly Airport is one of two international airports serving Paris, France, the other one being Charles de Gaulle Airport (CDG). It is located partially in Orly and partially in Villeneuve-le-Roi, 13 kilometres south of Paris. It serves as a secondary hub for domestic and overseas territories flights of Air France and as the homebase for Transavia France. Flights operate to destinations in Europe, the Middle East, Africa, the Caribbean, South America, and North America.", "points_nearby": []}, "LFRO": {"snippet": "Lannion–Côte de Granit Airport or Aéroport de Lannion–Côte de Granit is an airport located in Lannion, near the former municipality of Servel, a commune of the Côtes-d'Armor département in the Brittany région of France. It was also known as Lannion Airport or Lannion–Servel Airport.", "points_nearby": []}, "LFSB": {"snippet": "EuroAirport Basel Mulhouse Freiburg is an international airport in the administrative commune of Saint-Louis, in the French Alsace part of the Trinational Eurodistrict of Basel. It is 4.7 km (2.9 mi) west of the tripoint of France, Germany, and Switzerland, 3.5 km (2.2 mi) northwest of the city of Basel in Switzerland, 20 km (12 mi) southeast of Mulhouse in France, and 46 km (29 mi) south-southwest of Freiburg im Breisgau in Germany. The airport is jointly administered by France and Switzerland, governed by a 1949 international convention. The airport serves as a base for easyJet Switzerland and mainly features flights to European metropolitan and leisure destinations.", "points_nearby": []}, "LGAV": {"snippet": "Athens International Airport Eleftherios Venizelos, commonly initialised as AIA, is the largest international airport in Greece, serving the city of Athens and region of Attica. It began operation on 28 March 2001 and is the main base of Aegean Airlines, as well as other smaller Greek airlines. It replaced the old Ellinikon International Airport.", "points_nearby": []}, "LIMC": {"snippet": "Milan Malpensa Airport is an international airport in Ferno, in the Province of Varese, Lombardy, Italy. It is the largest airport in northern Italy, serving Lombardy, Piedmont, and Liguria, as well as the Swiss canton of Ticino. It is located 49 kilometres (30 mi) northwest of Milan, next to the Ticino river dividing Lombardy and Piedmont. The airport is located inside the Parco Naturale Lombardo Della Valle Del Ticino, a nature reserve included by UNESCO in the World Network of Biosphere Reserves. The airport was opened in 1909 by Giovanni Agusta and Gianni Caproni to test their aircraft prototypes, before switching to civil operation in 1948.", "points_nearby": []}, "LIME": {"snippet": "Milan Bergamo Airport, also formerly known as Orio al Serio International Airport, is the third-busiest international airport in Italy. \nThe airport is also officially called Il Caravaggio International Airport after the Baroque painter Michelangelo Merisi da Caravaggio, who originally hailed from the nearby town of Caravaggio.", "points_nearby": []}, "LIPZ": {"snippet": "Venice Marco Polo Airport is the international airport of Venice, Italy. It is located on the mainland near the village of Tessera, a frazione of the comune of Venice located about 4.1 nautical miles east of Mestre and around the same distance north of Venice proper. Due to the importance of Venice as a leisure destination, it features flights to many European metropolitan areas as well as some partly seasonal long-haul routes to the United States, Canada, South Korea and the Middle East. The airport handled 11,184,608 passengers in 2018, making it the fourth-busiest airport in Italy. The airport is named after Marco Polo and serves as a base for Volotea, Ryanair, Wizz Air and easyJet.", "points_nearby": []}, "LIRF": {"snippet": "Leonardo da Vinci Rome Fiumicino Airport is an international airport in Fiumicino, Italy, serving Rome, its metropolitan area, Vatican City and the wider Lazio region. It is the busiest airport in the country, the eighth-busiest airport in Europe and the world's 39th-busiest airport with over 51 million passengers served in 2025. It covers an area of 16 km2 (6.2 sq mi).", "points_nearby": []}, "LIRN": {"snippet": "Naples-Capodichino International Airport is the international airport serving Naples, its metropolitan city and the Campania region. According to 2023 data, the airport is the fourth-busiest airport in Italy and the busiest in Southern Italy. The airport serves as a base for easyJet, Ryanair, Volotea and Wizz Air. Located 3.2 NM north-northeast of the city in Naples, the airport is officially named Aeroporto di Napoli-Capodichino Ugo Niutta, after decorated WWI pilot Ugo Niutta. The airport covers 233 hectares of land and contains one runway.", "points_nearby": []}, "LKPR": {"snippet": "Václav Havel Airport Prague, formerly Prague Ruzyně International Airport, is an international airport of Prague, the capital of the Czech Republic. Its official name according to the Air Navigation Services of the Czech Republic is Praha/Ruzyně Airport. The airport was founded in 1937 when it replaced the Kbely Airport as the city's principal airport. It was reconstructed and extended in 1956, 1968, 1997, and 2006. In 2012, it was renamed after the last president of Czechoslovakia and the first president of the Czech Republic, Václav Havel. It is located at the edge of the Prague-Ruzyně area, next to Kněževes village, 12 km (7 mi) west of the centre of Prague and 12 km (7 mi) southeast of the city of Kladno.", "points_nearby": []}, "LOWW": {"snippet": "Vienna Airport is an international airport serving Vienna, the capital of Austria. It is located in Schwechat, 18 km (11 mi) southeast of central Vienna and 57 kilometres (35 mi) west of Bratislava, the capital of Slovakia. Its official name according to the Austrian Aeronautical Information Publication is Wien-Schwechat Airport. It is the country's largest airport and serves as the hub for Austrian Airlines as well as a base for low-cost carriers Ryanair and Wizz Air and since April 2025 also for leisure airline Condor. It is capable of handling wide-body aircraft up to the Airbus A380. The airport features a dense network of European destinations as well as long-haul flights to Asia, North America and Africa.", "points_nearby": []}, "LROP": {"snippet": "Bucharest Henri Coandă International Airport is Romania's busiest international airport, located in Otopeni, 16.5 km (10.3 mi) north of Bucharest's city centre. It is currently one of the two airports serving the capital of Romania, the other being the smaller Aurel Vlaicu Airport. The airport covers 605 hectares of land and contains two parallel runways, both 3,500 meters long.", "points_nearby": []}, "LSZH": {"snippet": "Zurich Airport is the largest international airport of Switzerland and the principal hub of Swiss International Air Lines. It serves Zurich, the largest city in Switzerland, and, with its surface transport links, much of the rest of the country. The airport is located 9 kilometres (5.6 mi) north of central Zurich, in the municipalities of Kloten, Rümlang, Oberglatt, Winkel, and Opfikon, all of which are within the canton of Zurich.", "points_nearby": []}, "NZAA": {"snippet": "Auckland Airport is an international airport serving Auckland, the most populous city of New Zealand. It is the largest and busiest airport in the country, with over 18.7 million passengers served in the year ended December 2024. The airport is operated by Auckland International Airport Limited and is located near Māngere, a residential suburb, and Airport Oaks, a service-hub suburb 21 kilometres (13 mi) south of the Auckland city centre. It serves as the principal hub for Air New Zealand, and the New Zealand operating base for Jetstar.", "points_nearby": []}, "RJTT": {"snippet": "Narita International Airport  — originally known as New Tokyo International Airport  — is the secondary international airport serving the Greater Tokyo Area, the other being Haneda Airport (HND). It is about 60 km (37 mi) east of central Tokyo in Narita, Chiba. The facility, since July 2019, covers 1,137 hectares of land and construction to expand to nearly 2,300 ha is underway.", "points_nearby": []}, "RKSI": {"snippet": "Incheon International Airport is the main international airport serving Seoul, the capital of South Korea. It is one of the largest and busiest airports in the world.", "points_nearby": []}, "WSSS": {"snippet": "Changi Airport is the principal international airport serving the Republic of Singapore, and functions as one of the most significant aviation gateways in the Asia-Pacific region. Situated within the Changi planning area in the eastern part of the country, the airport is approximately 24 kilometres from the Downtown Core and occupies a site spanning about 25-square-kilometre (9.7 sq mi). The airport is a base for more than 100 international carriers with scheduled services linking Singapore to destinations across Asia, Oceania, Africa, Europe, the Middle East and North America. As of 2025, Changi Airport handled 69.98 million passengers, ranking it as the 15th busiest globally.", "points_nearby": []}, "YSSY": {"snippet": "Sydney Kingsford Smith Airport — colloquially Kingsford Smith Airport, Sydney Airport or Mascot Airport — is an international airport located in Mascot, New South Wales, Australia, 8 km (5.0 mi) south of the Sydney CBD. It is the primary airport serving Sydney and its metropolitan area, and is the main hub for Qantas, the flagship airline of Australia, as well as a hub for Virgin Australia and an operating base for Jetstar.", "points_nearby": []}}